app/controllers/reservations_controller.rb

  def create
    @reservation = Reservation.new
    @reservation.party_size = params[:reservation][:party_size]
    @reservation.date = params[:reservation][:date]
    @reservation.time = params[:reservation][:time]
    @reservation.restaurant_id = params[:reservation][:restaurant_id ]
    @reservation.user_id = current_user.id

    if @reservation.save
---
INSERT INTO "reservations" ("party_size", "date", "time", "created_at", "updated_at", "restaurant_id", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["party_size", "11"], ["date", "2017-07-31"], ["time", 5], ["created_at", "2017-07-28 19:38:10.313975"], ["updated_at", "2017-07-28 19:38:10.313975"], ["restaurant_id", 9], ["user_id", 8]]

  def show
    @reservation = Reservation.find(params[:id])
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]