app/controllers/sessions_controller.rb

  def create
    u = User.find_by(email: params[:session][:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "ginasunah33@gmail.com"], ["LIMIT", 1]]