app/controllers/users_controller.rb

  def create
    @user = User.new

    @user.email = params[:user][:email]
    @user.password = params[:user][:password]
    @user.password_confirmation = params[:user][:password_confirmation]
    @user.account_type = params[:user][:account_type]
    # puts "log in !!  "
    # puts params[:user][:password]
    # puts params[:user][:password_confirmation]

    if @user.save
---
INSERT INTO "users" ("email", "created_at", "updated_at") VALUES (?, ?, ?)  [["email", "ginasunah33@gmail.com"], ["created_at", "2017-07-27 22:41:06.867599"], ["updated_at", "2017-07-27 22:41:06.867599"]]